doc/runbook.org
#+BEGIN_HEADER
#+TITLE: BBC R&D Zeitgeist: Runbook
#+SETUPFILE: ./setupfile.org
#+END_HEADER

* Background jobs

** Get status of background jobs

#+begin_src sh
  $ cd /var/www/webapps/zeitgeist
  $ sudo bg/status
#+end_src

** Start/restart/stop background jobs

#+begin_src sh
  $ cd /var/www/webapps/zeitgeist
  $ sudo bg/start all
  $ sudo bg/restart all
  $ sudo bg/stop all
#+end_src

** Start/restart/stop specific job

#+begin_src sh
  $ cd /var/www/webapps/zeitgeist
  $ sudo bg/stop bbc_links
#+end_src

Be careful about stopping jobs - queues can fill up very quickly and
crash rabbitmq by causing it to run out of memory.

** View log files

The log files are stored in =/tmp=, e.g.

#+begin_src sh
  $ tail -F /tmp/find_links_1.log
#+end_src

* Website

** Restart thin servers

#+begin_src sh
  $ sudo /sbin/service thin restart
#+end_src

** Restart nginx

#+begin_src sh
  $ sudo /sbin/service nginx restart
#+end_src

* More info

See [[./configuration.org][configuration]] for more information on what's configured where.

See [[./background-processes.org][background processes]] for more information on the background
processes and how they are configured.
